; ==============================================================================
; SETTINGS =ru= НАСТРОЙКИ
; ==============================================================================
; FileDescription: Settings for Keyboard_Switcher_Kaiu =ru= Настроки для Keyboard_Switcher_Kaiu
; FileVersion: 1.0.0.0 2020-07-30 \\ (Major version).(Minor version).(Revision number).(Build number) (year)-(month)-(day)
; Author: kaiu@mail.ru \\ author of code changes 
; ProductName: Keyboard_Switcher_Kaiu \\ included in the product
; OriginalFilename: settings.ini \\ What file is this code from
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; IMPORTANT! Use UTF16 LE file format with BOM (Notepad++ can edit such a file https://notepad-plus-plus.org/) 
; =ru= ВАЖНО! Использовать формат файла UTF16 LE with BOM (редактировать такой файл умеет Notepad++ https://notepad-plus-plus.org/) 
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; You can run the program with different settings stored in different *.ini files (just don't name settings.ini)
;   why in the shortcut to the program write the name of the ini file after Keyboard_Switcher_Kaiu.exe, example: Keyboard_Switcher_Kaiu.exe my.ini
; The ini files must be in the same directory as Keyboard_Switcher_Kaiu.exe
; =ru= Вы можете запускать программу с разными настройками сохраненными в разных файлах *.ini (только не называйте settings.ini)
; =ru=   для чего в ярлыке к программе пропишите после Keyboard_Switcher_Kaiu.exe имя ini файла, пример: Keyboard_Switcher_Kaiu.exe my.ini
; =ru= Файлы ini должны лежать в этом же каталоге, что и Keyboard_Switcher_Kaiu.exe 
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−

; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
[MAIN]
; localization file from "localization" directory (program language)
; =ru= файл локализации из каталога "localization" (язык программы)
FileLocalization=English.ini

; Help file (*.jpg or *.txt or *.pdf or ...)
; =ru= Файл справки (*.jpg or *.txt or *.pdf or ...)
HelpFile=readme.txt

; Is language tooltip allowed (1-yes, 0-no)
; =ru= Разрешена ли всплывающая подсказка по языку (1-да, 0-нет)
ShowToolTip=1

; Is it allowed to play the layout switching sound
; =ru= Разрешено ли проигрывать звук переключения раскладки
PlaySound=1

; Sound level at startup =ru= Уровень звука при запуске
; =1 or 2 or 3
SoundLevelAtStartup=2

; time to switch layout [ms] (200 ... 500)
; =ru= время на переключение раскладки [mS] (200 ... 500)
TimeSwitchLayout=250

; Toggle CapsLock by simultaneously pressing LShift + RShift (1-yes, 0-no)
; =ru= Переключать CapsLock одновременным нажатием LShift + RShift (1-да, 0-нет)
LShift_RShift_CapsLock=1

; time to switch CapsLock [ms] (300 ... 500)
; =ru= время на переключение CapsLock [mS] (300 ... 500)
TimeSwitchCapsLock=300

; sound files for voicing CapsLock switching (in the catalog "sound")
; =ru= звуковые файлы для озвучивания переключения CapsLock (в каталоге "sound") 
FileSoundCapsLockON=CapsLockON.wav
FileSoundCapsLockOFF=CapsLockOFF.wav



; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; all your layouts in the system (on each line there is one entry like: HKL, ISO, Name, Sound, INPUT_LNG, LAYOUT_NAME)
; it is important to set a short unique Name as it is shown to you when you switch to this layout
; and change if required Sound - the name of the file in the Sound folder for sounding
; =ru= все ваши раскладки в системе (на каждой строке одна запись вида: HKL, ISO, Name, Sound, INPUT_LNG, LAYOUT_NAME) 
; =ru= важно задать краткое уникальное имя Name, так как оно показывается вам при переключении в эту раскладку
; =ru= и измените если требуется Sound - имя файла в папке Sound для озвучивания 
;      HKL,  ISO, Name, Sound, INPUT_LNG, LAYOUT_NAME 
[PLACE_FOR_SECTION_KEYBOARDS]
[KEYBOARDS]
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 1 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 1 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_1]
0x04190419, ru_RU
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 2 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 2 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_2]
0x04090409, en_US
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 3 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 3 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_3]
0x04190419, ru_RU
0x04090409, en_US
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 4 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 4 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_4]
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 5 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 5 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_5]
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 6 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 6 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_6]
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 7 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 7 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_7]
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−
; Alternative 8 list of layouts (one entry per line: HKL, ISO)
; =ru= Альтернативный 8 список раскладок  (на каждой строке одна запись вида: HKL, ISO)
[LAYOUT_LIST_8]
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−   
[CAPSLOCK_OPTIONS]
; Ability to change the default behavior of CapsLock
; (in any case, you can switch by pressing Alt + CapsLock)
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение CapsLock
; =ru= (в любом случае, вы можете переключить нажав Alt + CapsLock)
; =ru= Может принимать только одно из значений:

; =    - empty or do not change =ru= пустое или не менять
; =Disable - disable =ru=  отключить
; =LCtrl - like LCtrl =ru=  как LCtrl
; =LShift - like LShift =ru=  как LShift
; =Tab - like Tab =ru=  как Tab
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
CapsLockOption=AllLayouts
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−  
[LSHIFT_OPTIONS]
; Ability to change the default behavior of LShift
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение LShift
; =ru= Может принимать только одно из значений:

; =    - empty or do not change =ru= пустое или не менять
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
LShiftOption=1
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−  
[RSHIFT_OPTIONS]
; Ability to change the default behavior of RShift
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение RShift
; =ru= Может принимать только одно из значений:

; =    - empty or do not change =ru= пустое или не менять
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
RShiftOption=2
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−   
[LCTRL_OPTIONS]
; Ability to change the default behavior of LCtrl
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение LCtrl
; =ru= Может принимать только одно из значений:

; =    - empty or do not change =ru= пустое или не менять
; =Disable - disable =ru=  отключить
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
LCtrlOption=
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−   
[RCTRL_OPTIONS]
; Ability to change the default behavior of RCtrl
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение RCtrl
; =ru= Может принимать только одно из значений:

; =    - empty or do not change =ru= пустое или не менять
; =Disable - disable =ru=  отключить
; =RAlt - like RAlt =ru=  как RAlt
; =RShift - like RShift =ru=  как RShift
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
RCtrlOption=
; −−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−−   
[LALT_SPACE_OPTIONS]
; Ability to change the default behavior of LAlt + Space
; Can only take one of the following values:
; =ru= Возможность изменить стандартное поведение LAlt + Space
; =ru= Может принимать только одно из значений:

; =    - empty or do not change =ru= пустое или не менять
; =AllLayouts - switch all layouts =ru= переключать все раскладки
; =1 or 2 ... 8 (LAYOUT_LIST_1 or LAYOUT_LIST_2...LAYOUT_LIST_8)  switching from an alternative list of layouts =ru= переключение из альтернативного списка раскладок
LAltSpaceOption=3
; ==============================================================================



